from pyrogram import Client
from pyrogram.types import Message

async def commands_command(client: Client, message: Message):
    text = (
        "<b>📖 Список команд юзербота</b>\n\n"
        "• <code>.who [username|ID]</code> — Инфо о пользователе\n"
        "• <code>.langs</code> - Посмотреть список языковых кодов (для команды .tr)\n"
        "• <code>.settings</code> — Посмотреть текущие настройки скрипта\n\n"
        "• <code>.search [запрос]</code> — Найти сообщение в пределах чата\n"
        "• <code>.web [запрос]</code> — Найти информацию в интернете\n"
        "• <code>.m [запрос]</code> — Найти песню\n"
        "• <code>.gen [запрос]</code> — Сгенерировать изображение\n"
        "• <code>.dl [ссылка]</code> — Скачать видео из YouTube/TikTok\n\n"
        "• <code>.spam [интервал] [текст]</code> — Запустить спам\n"
        "• <code>.stopspam</code> — Остановить спам\n"
        "• <code>.tagall [текст]</code> — Упомянуть всех участников группы\n"
        "• <code>.tr [код языка]</code> - Перевести текст сообщения (использование в ответ на сообщение)\n"
        "• <code>.st</code> - Сделать стикер из фотографии (использование в ответ на фото)\n"
        "• <code>.kang</code> - Сделать из стикера фото/видео (использование в ответ на стикер)\n"
        "• <code>.quote</code> - Сделать цитату из текстового сообщения (использование в ответ на сообщение)\n"
        "• <code>.stt</code> — Расшифровать голосовое в текст (использование в ответ на голосовое сообщение)\n\n"
        "• <code>.restart</code> — Перезагрузка бота\n\n"
        "• <code>.commands</code> — Показать этот список"
    )
    await message.edit_text(text)